name: "sleep_yolo"
platform: "onnxruntime_onnx"
max_batch_size: 8

input [
  {
    name: "images"
    data_type: TYPE_FP32
    dims: [3, -1, -1]
  }
]

output [
  {
    name: "output0"
    data_type: TYPE_FP32
    dims: [10, -1]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]
